Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/cohabiting_couples/fostering_and_unmarried_couples.html.txt.tmx
Source language: en
Languages: ga

source: Fostering and cohabiting couples
ga: Altramú agus lánúineacha comhchónaithe

source: When a child needs care or protection, or when they cannot live with their own family either on a short-term or long-term basis, they may be taken into care by the Child and Family Agency (Tusla)
ga: Nuair a theastaíonn cúram nó cosaint ó leanbh, nó nuair nach féidir leo cónaí lena dteaghlach féin ar bhonn gearrthéarmach nó fadtéarmach, féadfaidh an Ghníomhaireacht um Leanaí agus an Teaghlach (Tusla) iad a thógáil isteach faoi chúram

source: The reason for taking a child into care could be illness in the family, the death of a parent, neglect, abuse or violence in the home
ga: D’fhéadfadh breoiteacht sa teaghlach, bás tuismitheora, faillí, drochíde a imirt nó foréigean sa bhaile bheith ina chúis leis an leanbh a thógáil isteach faoi chúram

source: Sometimes, it could be an economic reason, like unemployment
ga: Corruair, d’fhéadfadh cúis gheilleagrach bheith leis, ar nós dífhostaíochta

source: Tusla will decide on the type of care that the child should be given, having regard to the "best interests" of the child
ga: Déanfaidh Tusla cinneadh ar an saghas cúraim ar cheart tabhairt don leanbh, agus aird ar “leas is fearr” an linbh

source: One of the options available to Tusla is to place the child with a foster parent or foster family
ga: Ceann de na roghanna atá ar fáil do Tusla ná an leanbh a thabhairt do thuismitheoir altrama nó do theaghlach altrama

source: A foster parent is a person who is taking care of the child on behalf of Tusla
ga: Duine atá i gceist le tuismitheoir altrama a thugann aire don leanbh ar son Tusla

source: Young people up to the age of 18 can be fostered
ga: Féadtar daoine óga a fhad le 18 mbliana d’aois a altramú

source: Any person or family can apply to Tusla to be assessed as a foster parent or foster family
ga: Féadfaidh aon duine nó teaghlach iarratas a dhéanamh ar Tusla go ndéanfar measúnú orthu mar thuismitheoir nó mar theaghlach altrama

source: You do not have to be married to be a foster parent
ga: Ní gá duit bheith pósta chun bheith i do thuismitheoir

source: In fact, you could be a single person, a cohabiting same-sex or opposite sex couple or a civil partnership
ga: D'fhéadfá fiú bheith mar dhuine singil, lánúin chomhchónaithe nó chomhghnéis nó páirtnéirí sibhialta

source: You must be able to provide adequate and appropriate accommodation for the foster child
ga: Ní mór go mbeifeá in ann cóiríocht leordhóthanach agus oiriúnach a chur ar fáil don leanbh altrama

source: There is a shortage of foster parents and new applications and enquiries are always welcome
ga: Táimid ar an ngannchuid i dtaobh tuismitheoirí altrama agus fáiltítear i gcónaí iarratais nua agus fiosrúcháin

source: Tusla assigns a social worker to carry out an assessment of your suitability
ga: Déanann Tusla oibreoir sóisialta a shannadh le tabhairt faoi mheasúnú ar d’oiriúnacht

source: These assessments include meeting all members of the family (particularly the foster parents) over a number of months
ga: Áirítear leis na measúnuithe seo casadh le gach duine den teaghlach (go háirithe na tuismitheoirí altrama) thar cúpla mí

source: References, Garda clearance and medical examinations will also be required as part of this process
ga: Ina theannta sin, teastóidh teistiméireachtaí, imréiteach slándála an Gharda Síochána mar chuid den phróiseas seo

source: Every effort is made to ensure that those selected as foster carers and foster families are suitable
ga: Déantar gach iarracht lena chinntiú go bhfuil iad siúd a roghnaítear bheith ina gcúramóirí altrama oiriúnach

source: You can read more detailed information about the types of foster care, rules, etc
ga: Féadfaidh tú faisnéis níos sonraí a léamh faoi na saghsanna cúram altrama, rialacha, etc

source: in our document on fostering in Ireland
ga: inár ndoiciméad maidir le haltramú in Éirinn
